ticketTrain/consumer/src/test/resources/requests/payment/getSearchByDateRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xs="http://epam.com/brest2019/courses/soap/model/payment">

    <soapenv:Header/>
    <soapenv:Body>
        <xs:getSearchByDateRequest>
            <xs:startDate>2019-09-10</xs:startDate>
            <xs:finishDate>2019-09-20</xs:finishDate>
        </xs:getSearchByDateRequest>
    </soapenv:Body>

</soapenv:Envelope>